package com.example.personalmushaf.navigation;

public class MadaniFifteenLinePageData {
    private static final MadaniFifteenLinePageData ourInstance = new MadaniFifteenLinePageData();

    //    0              1          2               3
    //{juz number, jus length, starting word(s), page number}
    public static String[][] juzInfo = {
            {"٠١", "21", "الم",            "1" },
            {"٠٢", "20", "سيقول السفهاء",  "22" },
            {"٠٣", "20", "تلك الرسل",      "42" },
            {"٠٤", "20", "لن تنال البر",   "62" },
            {"٠٥", "20", "والمحصنات",      "82" },
            {"٠٦", "19", "لا يحب الله",     "102" },
            {"٠٧", "21", "وإذا سمعوا",     "121" },
            {"٠٨", "20", "ولو أننا نزلنا", "142" },
            {"٠٩", "20", "وقال الملا",      "162" },
            {"١٠", "19", "واعلموا أنما",   "182" },
            {"١١", "21", "يعتذرون إليكم",  "201" },
            {"١٢", "20", "وما من دآبة",    "222" },
            {"١٣", "20", "وما أبرئ",       "242" },
            {"١٤", "20", "ربما يود",       "262" },
            {"١٥", "20", "سبحان الذي",     "282" },
            {"١٦", "20", "قال ألم",        "302" },
            {"١٧", "20", "اقترب للناس",    "322" },
            {"١٨", "20", "قد أفلح",        "342" },
            {"١٩", "20", "وقال الذين",     "362" },
            {"٢٠", "20", "أمن خلق",        "382" },
            {"٢١", "20", "أتل ما أوحي",    "402" },
            {"٢٢", "20", "ومن يقنت",       "422" },
            {"٢٣", "20", "ومالي لا",        "442" },
            {"٢٤", "20", "فمن أظلم",       "462" },
            {"٢٥", "20", "إليه يرد",       "482" },
            {"٢٦", "20", "حم",             "502" },
            {"٢٧", "20", "قال فما خطبكم",  "522" },
            {"٢٨", "20", "قد سمع الله",    "542" },
            {"٢٩", "20", "تبرك الذي",      "562" },
            {"٣٠", "22", "عم يتسائلون",    "582" },
    };


    public static String[][][] juzQuarterInfo = {
            {{"", "1"   }, {"", "5"   }, {"", "7"   }, {"", "9"   }, {"", "11"  }, {"", "14"  }, {"", "17"  }, {"", "19"  },}, //1
            {{"", "22"  }, {"", "24"  }, {"", "27"  }, {"", "29"  }, {"", "32"  }, {"", "34"  }, {"", "37"  }, {"", "39"  },}, //2
            {{"", "42"  }, {"", "44"  }, {"", "46"  }, {"", "49"  }, {"", "51"  }, {"", "54"  }, {"", "56"  }, {"", "59"  },}, //3
            {{"", "62"  }, {"", "64"  }, {"", "67"  }, {"", "69"  }, {"", "72"  }, {"", "74"  }, {"", "77"  }, {"", "79"  },}, //4
            {{"", "82" },  {"", "84"  }, {"", "87"  }, {"", "89"  }, {"", "92"  }, {"", "94"  }, {"", "97"  }, {"", "100" },}, //5
            {{"", "102" }, {"", "104" }, {"", "106" }, {"", "109" }, {"", "112" }, {"", "114" }, {"", "117" }, {"", "119" },}, //6
            {{"", "121" }, {"", "124" }, {"", "126" }, {"", "129" }, {"", "132" }, {"", "134" }, {"", "137" }, {"", "140" },}, //7
            {{"", "142" }, {"", "144" }, {"", "146" }, {"", "148" }, {"", "151" }, {"", "154" }, {"", "156" }, {"", "158" },}, //8
            {{"", "162" }, {"", "164" }, {"", "167" }, {"", "170" }, {"", "173" }, {"", "175" }, {"", "177" }, {"", "179" },}, //9
            {{"", "182" }, {"", "184" }, {"", "187" }, {"", "189" }, {"", "192" }, {"", "194" }, {"", "196" }, {"", "199" },}, //10
            {{"", "201" }, {"", "204" }, {"", "206" }, {"", "209" }, {"", "212" }, {"", "214" }, {"", "217" }, {"", "219" },}, //11
            {{"", "222" }, {"", "224" }, {"", "226" }, {"", "228" }, {"", "231" }, {"", "233" }, {"", "236" }, {"", "238" },}, //12
            {{"", "242" }, {"", "244" }, {"", "247" }, {"", "249" }, {"", "252" }, {"", "254" }, {"", "256" }, {"", "259" },}, //13
            {{"", "262" }, {"", "264" }, {"", "267" }, {"", "270" }, {"", "272" }, {"", "276" }, {"", "277" }, {"", "280" },}, //14
            {{"", "282" }, {"", "284" }, {"", "287" }, {"", "289" }, {"", "292" }, {"", "295" }, {"", "297" }, {"", "299" },}, //15
            {{"", "302" }, {"", "304" }, {"", "306" }, {"", "309" }, {"", "312" }, {"", "315" }, {"", "317" }, {"", "319" },}, //16
            {{"", "322" }, {"", "324" }, {"", "326" }, {"", "329" }, {"", "332" }, {"", "334" }, {"", "336" }, {"", "339" },}, //17
            {{"", "342" }, {"", "344" }, {"", "347" }, {"", "350" }, {"", "352" }, {"", "354" }, {"", "356" }, {"", "359" },}, //18
            {{"", "362" }, {"", "364" }, {"", "367" }, {"", "369" }, {"", "371" }, {"", "374" }, {"", "377" }, {"", "379" },}, //19
            {{"", "382" }, {"", "384" }, {"", "386" }, {"", "389" }, {"", "392" }, {"", "394" }, {"", "396" }, {"", "399" },}, //20
            {{"", "402" }, {"", "404" }, {"", "407" }, {"", "410" }, {"", "413" }, {"", "415" }, {"", "418" }, {"", "420" },}, //21
            {{"", "422" }, {"", "425" }, {"", "426" }, {"", "429" }, {"", "431" }, {"", "433" }, {"", "436" }, {"", "439" },}, //22
            {{"", "442" }, {"", "444" }, {"", "446" }, {"", "449" }, {"", "451" }, {"", "454" }, {"", "456" }, {"", "459" },}, //23
            {{"", "462" }, {"", "464" }, {"", "467" }, {"", "469" }, {"", "472" }, {"", "474" }, {"", "477" }, {"", "479" },}, //24
            {{"", "482" }, {"", "484" }, {"", "486" }, {"", "488" }, {"", "491" }, {"", "493" }, {"", "496" }, {"", "499" },}, //25
            {{"", "502" }, {"", "505" }, {"", "507" }, {"", "510" }, {"", "513" }, {"", "515" }, {"", "517" }, {"", "519" },}, //26
            {{"", "522" }, {"", "524" }, {"", "526" }, {"", "529" }, {"", "531" }, {"", "534" }, {"", "536" }, {"", "539" },}, //27
            {{"", "542" }, {"", "544" }, {"", "547" }, {"", "550" }, {"", "553" }, {"", "554" }, {"", "558" }, {"", "560" },}, //28
            {{"", "562" }, {"", "564" }, {"", "566" }, {"", "569" }, {"", "572" }, {"", "575" }, {"", "577" }, {"", "579" },}, //29
            {{"", "582" }, {"", "585" }, {"", "587" }, {"", "589" }, {"", "591" }, {"", "594" }, {"", "596" }, {"", "599" },}, //30
    };

    public static String[][] juzQuarterPrefixes = {
            {"بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ","إِنَّ اللَّهَ لَا يَسْتَحْيِي أَن"," أَتَأْمُرُونَ النَّاسَ بِالْبِرِّ"," وَإِذِ اسْتَسْقَىٰ مُوسَىٰ لِقَوْمِهِ"," أَفَتَطْمَعُونَ أَن يُؤْمِنُوا لَكُمْ"," وَلَقَدْ جَاءَكُم مُّوسَىٰ"," مَا نَنسَخْ مِنْ آيَةٍ أَوْ نُنسِهَا"," وَإِذِ ابْتَلَىٰ إِبْرَاهِيمَ رَبُّهُ",},
            {" سَيَقُولُ السُّفَهَاءُ مِنَ النَّاسِ"," إِنَّ الصَّفَا وَالْمَرْوَةَ مِن"," لَّيْسَ الْبِرَّ أَن تُوَلُّوا"," يَسْأَلُونَكَ عَنِ الْأَهِلَّةِ ۖ قُلْ"," وَاذْكُرُوا اللَّهَ فِي أَيَّامٍ"," يَسْأَلُونَكَ عَنِ الْخَمْرِ"," وَالْوَالِدَاتُ يُرْضِعْنَ"," أَلَمْ تَرَ إِلَى الَّذِينَ خَرَجُوا",},
            {" تِلْكَ الرُّسُلُ فَضَّلْنَا"," قَوْلٌ مَّعْرُوفٌ وَمَغْفِرَةٌ خَيْرٌ"," لَّيْسَ عَلَيْكَ هُدَاهُمْ وَلَٰكِنَّ"," وَإِن كُنتُمْ عَلَىٰ سَفَرٍ وَلَمْ"," قُلْ أَؤُنَبِّئُكُم بِخَيْرٍ مِّن"," إِنَّ اللَّهَ اصْطَفَىٰ آدَمَ وَنُوحًا"," فَلَمَّا أَحَسَّ عِيسَىٰ مِنْهُمُ"," وَمِنْ أَهْلِ الْكِتَابِ مَنْ إِن",},
            {" كُلُّ الطَّعَامِ كَانَ حِلًّا لِّبَنِي"," لَيْسُوا سَوَاءً ۗ مِّنْ أَهْلِ"," وَسَارِعُوا إِلَىٰ مَغْفِرَةٍ مِّن"," إِذْ تُصْعِدُونَ وَلَا تَلْوُونَ"," يَسْتَبْشِرُونَ بِنِعْمَةٍ مِّنَ"," لَتُبْلَوُنَّ فِي أَمْوَالِكُمْ","  يَا أَيُّهَا النَّاسُ اتَّقُوا"," وَلَكُمْ نِصْفُ مَا تَرَكَ",},
            {" وَالْمُحْصَنَاتُ مِنَ النِّسَاءِ"," وَاعْبُدُوا اللَّهَ وَلَا تُشْرِكُوا"," إِنَّ اللَّهَ يَأْمُرُكُمْ أَن"," فَلْيُقَاتِلْ فِي سَبِيلِ اللَّهِ"," فَمَا لَكُمْ فِي الْمُنَافِقِينَ"," وَمَن يُهَاجِرْ فِي سَبِيلِ اللَّهِ"," لَّا خَيْرَ فِي كَثِيرٍ مِّن"," يَا أَيُّهَا الَّذِينَ آمَنُوا كُونُوا",},
            {" لَّا يُحِبُّ اللَّهُ الْجَهْرَ"," إِنَّا أَوْحَيْنَا إِلَيْكَ كَمَا","  يَا أَيُّهَا الَّذِينَ آمَنُوا"," وَلَقَدْ أَخَذَ اللَّهُ مِيثَاقَ بَنِي"," وَاتْلُ عَلَيْهِمْ نَبَأَ ابْنَيْ"," يَا أَيُّهَا الرَّسُولُ لَا يَحْزُنكَ"," يَا أَيُّهَا الَّذِينَ آمَنُوا لَا"," يَا أَيُّهَا الرَّسُولُ بَلِّغْ مَا",},
            {" لَتَجِدَنَّ أَشَدَّ النَّاسِ"," جَعَلَ اللَّهُ الْكَعْبَةَ الْبَيْتَ"," يَوْمَ يَجْمَعُ اللَّهُ الرُّسُلَ"," وَلَهُ مَا سَكَنَ فِي اللَّيْلِ"," إِنَّمَا يَسْتَجِيبُ الَّذِينَ"," وَعِندَهُ مَفَاتِحُ الْغَيْبِ لَا"," وَإِذْ قَالَ إِبْرَاهِيمُ لِأَبِيهِ"," إِنَّ اللَّهَ فَالِقُ الْحَبِّ",},
            {" وَلَوْ أَنَّنَا نَزَّلْنَا إِلَيْهِمُ"," لَهُمْ دَارُ السَّلَامِ عِندَ"," وَهُوَ الَّذِي أَنشَأَ جَنَّاتٍ"," قُلْ تَعَالَوْا أَتْلُ مَا حَرَّمَ","  المص"," يَا بَنِي آدَمَ خُذُوا زِينَتَكُمْ"," وَإِذَا صُرِفَتْ أَبْصَارُهُمْ"," وَإِلَىٰ عَادٍ أَخَاهُمْ هُودًا ۗ",},
            {" قَالَ الْمَلَأُ الَّذِينَ"," وَأَوْحَيْنَا إِلَىٰ مُوسَىٰ أَنْ"," وَوَاعَدْنَا مُوسَىٰ ثَلَاثِينَ"," وَاكْتُبْ لَنَا فِي هَٰذِهِ الدُّنْيَا"," وَإِذْ نَتَقْنَا الْجَبَلَ فَوْقَهُمْ"," هُوَ الَّذِي خَلَقَكُم مِّن نَّفْسٍ","  يَسْأَلُونَكَ عَنِ الْأَنفَالِ ۖ قُلِ"," إِنَّ شَرَّ الدَّوَابِّ عِندَ اللَّهِ",},
            {" وَاعْلَمُوا أَنَّمَا غَنِمْتُم مِّن"," وَإِن جَنَحُوا لِلسَّلْمِ فَاجْنَحْ"," بَرَاءَةٌ مِّنَ اللَّهِ وَرَسُولِهِ"," أَجَعَلْتُمْ سِقَايَةَ الْحَاجِّ"," يَا أَيُّهَا الَّذِينَ آمَنُوا إِنَّ"," وَلَوْ أَرَادُوا الْخُرُوجَ"," إِنَّمَا الصَّدَقَاتُ لِلْفُقَرَاءِ"," وَمِنْهُم مَّنْ عَاهَدَ اللَّهَ لَئِنْ",},
            {" إِنَّمَا السَّبِيلُ عَلَى الَّذِينَ"," إِنَّ اللَّهَ اشْتَرَىٰ مِنَ"," وَمَا كَانَ الْمُؤْمِنُونَ"," وَلَوْ يُعَجِّلُ اللَّهُ لِلنَّاسِ"," لِّلَّذِينَ أَحْسَنُوا الْحُسْنَىٰ"," وَيَسْتَنبِئُونَكَ أَحَقٌّ هُوَ ۖ قُلْ"," وَاتْلُ عَلَيْهِمْ نَبَأَ نُوحٍ إِذْ"," وَجَاوَزْنَا بِبَنِي إِسْرَائِيلَ",},
            {" وَمَا مِن دَابَّةٍ فِي الْأَرْضِ"," مَثَلُ الْفَرِيقَيْنِ كَالْأَعْمَىٰ"," وَقَالَ ارْكَبُوا فِيهَا بِسْمِ"," وَإِلَىٰ ثَمُودَ أَخَاهُمْ صَالِحًا ۚ"," وَإِلَىٰ مَدْيَنَ أَخَاهُمْ شُعَيْبًا"," وَأَمَّا الَّذِينَ سُعِدُوا فَفِي"," لَّقَدْ كَانَ فِي يُوسُفَ وَإِخْوَتِهِ"," وَقَالَ نِسْوَةٌ فِي الْمَدِينَةِ",},
            {" وَمَا أُبَرِّئُ نَفْسِي ۚ إِنَّ"," قَالُوا إِن يَسْرِقْ فَقَدْ سَرَقَ"," رَبِّ قَدْ آتَيْتَنِي مِنَ الْمُلْكِ"," وَإِن تَعْجَبْ فَعَجَبٌ قَوْلُهُمْ"," أَفَمَن يَعْلَمُ أَنَّمَا أُنزِلَ"," مَّثَلُ الْجَنَّةِ الَّتِي وُعِدَ"," قَالَتْ رُسُلُهُمْ أَفِي اللَّهِ شَكٌّ"," أَلَمْ تَرَ إِلَى الَّذِينَ بَدَّلُوا",},
            {"  الر ۚ تِلْكَ آيَاتُ الْكِتَابِ"," نَبِّئْ عِبَادِي أَنِّي أَنَا الْغَفُورُ الرَّحِيمُ","  أَتَىٰ أَمْرُ اللَّهِ فَلَا"," وَقِيلَ لِلَّذِينَ اتَّقَوْا مَاذَا"," وَقَالَ اللَّهُ لَا تَتَّخِذُوا"," ضَرَبَ اللَّهُ مَثَلًا عَبْدًا"," إِنَّ اللَّهَ يَأْمُرُ بِالْعَدْلِ"," يَوْمَ تَأْتِي كُلُّ نَفْسٍ تُجَادِلُ",},
            {"  سُبْحَانَ الَّذِي أَسْرَىٰ بِعَبْدِهِ"," وَقَضَىٰ رَبُّكَ أَلَّا تَعْبُدُوا"," قُلْ كُونُوا حِجَارَةً أَوْ حَدِيدًا"," وَلَقَدْ كَرَّمْنَا بَنِي آدَمَ"," أَوَلَمْ يَرَوْا أَنَّ اللَّهَ الَّذِي"," وَتَرَى الشَّمْسَ إِذَا طَلَعَت"," وَاضْرِبْ لَهُم مَّثَلًا رَّجُلَيْنِ"," مَّا أَشْهَدتُّهُمْ خَلْقَ",},
            {" قَالَ أَلَمْ أَقُل لَّكَ إِنَّكَ لَن"," وَتَرَكْنَا بَعْضَهُمْ يَوْمَئِذٍ"," فَحَمَلَتْهُ فَانتَبَذَتْ بِهِ"," فَخَلَفَ مِن بَعْدِهِمْ خَلْفٌ","  طه"," مِنْهَا خَلَقْنَاكُمْ وَفِيهَا"," وَمَا أَعْجَلَكَ عَن قَوْمِكَ يَا"," وَعَنَتِ الْوُجُوهُ لِلْحَيِّ",},
            {"  اقْتَرَبَ لِلنَّاسِ حِسَابُهُمْ"," وَمَن يَقُلْ مِنْهُمْ إِنِّي إِلَٰهٌ"," وَلَقَدْ آتَيْنَا إِبْرَاهِيمَ"," وَأَيُّوبَ إِذْ نَادَىٰ رَبَّهُ أَنِّي","  يَا أَيُّهَا النَّاسُ اتَّقُوا"," هَٰذَانِ خَصْمَانِ اخْتَصَمُوا فِي"," إِنَّ اللَّهَ يُدَافِعُ عَنِ الَّذِينَ"," ذَٰلِكَ وَمَنْ عَاقَبَ بِمِثْلِ مَا",},
            {"  قَدْ أَفْلَحَ الْمُؤْمِنُونَ"," هَيْهَاتَ هَيْهَاتَ لِمَا تُوعَدُونَ"," وَلَوْ رَحِمْنَاهُمْ وَكَشَفْنَا مَا","  سُورَةٌ أَنزَلْنَاهَا وَفَرَضْنَاهَا"," يَا أَيُّهَا الَّذِينَ آمَنُوا لَا"," اللَّهُ نُورُ السَّمَاوَاتِ"," وَأَقْسَمُوا بِاللَّهِ جَهْدَ","  تَبَارَكَ الَّذِي نَزَّلَ",},
            {" وَقَالَ الَّذِينَ لَا يَرْجُونَ"," وَهُوَ الَّذِي مَرَجَ الْبَحْرَيْنِ","  طسم"," وَأَوْحَيْنَا إِلَىٰ مُوسَىٰ أَنْ"," قَالُوا أَنُؤْمِنُ لَكَ وَاتَّبَعَكَ"," أَوْفُوا الْكَيْلَ وَلَا تَكُونُوا","  طس ۚ تِلْكَ آيَاتُ الْقُرْآنِ"," قَالَ سَنَنظُرُ أَصَدَقْتَ أَمْ كُنتَ",},
            {" فَمَا كَانَ جَوَابَ قَوْمِهِ إِلَّا"," وَإِذَا وَقَعَ الْقَوْلُ عَلَيْهِمْ"," وَحَرَّمْنَا عَلَيْهِ الْمَرَاضِعَ"," فَلَمَّا قَضَىٰ مُوسَى الْأَجَلَ"," وَلَقَدْ وَصَّلْنَا لَهُمُ الْقَوْلَ"," إِنَّ قَارُونَ كَانَ مِن قَوْمِ","  الم"," فَآمَنَ لَهُ لُوطٌ ۘ وَقَالَ إِنِّي",},
            {" وَلَا تُجَادِلُوا أَهْلَ الْكِتَابِ","  الم"," مُنِيبِينَ إِلَيْهِ وَاتَّقُوهُ"," اللَّهُ الَّذِي خَلَقَكُم مِّن ضَعْفٍ"," وَمَن يُسْلِمْ وَجْهَهُ إِلَى اللَّهِ"," قُلْ يَتَوَفَّاكُم مَّلَكُ الْمَوْتِ","  يَا أَيُّهَا النَّبِيُّ اتَّقِ"," قَدْ يَعْلَمُ اللَّهُ الْمُعَوِّقِينَ",},
            {" وَمَن يَقْنُتْ مِنكُنَّ لِلَّهِ"," تُرْجِي مَن تَشَاءُ مِنْهُنَّ"," لَّئِن لَّمْ يَنتَهِ الْمُنَافِقُونَ"," وَلَقَدْ آتَيْنَا دَاوُودَ مِنَّا"," قُلْ مَن يَرْزُقُكُم مِّنَ"," قُلْ إِنَّمَا أَعِظُكُم بِوَاحِدَةٍ ۖ"," يَا أَيُّهَا النَّاسُ أَنتُمُ"," إِنَّ اللَّهَ يُمْسِكُ السَّمَاوَاتِ",},
            {" وَمَا أَنزَلْنَا عَلَىٰ قَوْمِهِ مِن"," أَلَمْ أَعْهَدْ إِلَيْكُمْ يَا بَنِي"," احْشُرُوا الَّذِينَ ظَلَمُوا"," وَإِنَّ مِن شِيعَتِهِ لَإِبْرَاهِيمَ"," فَنَبَذْنَاهُ بِالْعَرَاءِ وَهُوَ"," وَهَلْ أَتَاكَ نَبَأُ الْخَصْمِ إِذْ"," وَعِندَهُمْ قَاصِرَاتُ الطَّرْفِ"," وَإِذَا مَسَّ الْإِنسَانَ ضُرٌّ دَعَا",},
            {" فَمَنْ أَظْلَمُ مِمَّن كَذَبَ عَلَى"," قُلْ يَا عِبَادِيَ الَّذِينَ","  حم"," أَوَلَمْ يَسِيرُوا فِي الْأَرْضِ"," وَيَا قَوْمِ مَا لِي أَدْعُوكُمْ إِلَى"," قُلْ إِنِّي نُهِيتُ أَنْ أَعْبُدَ"," قُلْ أَئِنَّكُمْ لَتَكْفُرُونَ"," وَقَيَّضْنَا لَهُمْ قُرَنَاءَ",},
            {" إِلَيْهِ يُرَدُّ عِلْمُ السَّاعَةِ ۚ"," شَرَعَ لَكُم مِّنَ الدِّينِ مَا"," وَلَوْ بَسَطَ اللَّهُ الرِّزْقَ"," وَمَا كَانَ لِبَشَرٍ أَن يُكَلِّمَهُ"," قَالَ أَوَلَوْ جِئْتُكُم بِأَهْدَىٰ"," وَلَمَّا ضُرِبَ ابْنُ مَرْيَمَ مَثَلًا"," وَلَقَدْ فَتَنَّا قَبْلَهُمْ قَوْمَ"," اللَّهُ الَّذِي سَخَّرَ لَكُمُ",},
            {"  حم"," وَاذْكُرْ أَخَا عَادٍ إِذْ أَنذَرَ"," أَفَلَمْ يَسِيرُوا فِي الْأَرْضِ"," يَا أَيُّهَا الَّذِينَ آمَنُوا"," لَّقَدْ رَضِيَ اللَّهُ عَنِ","  يَا أَيُّهَا الَّذِينَ آمَنُوا لَا"," قَالَتِ الْأَعْرَابُ آمَنَّا ۖ قُل"," قَالَ قَرِينُهُ رَبَّنَا مَا",},
            {" قَالَ فَمَا خَطْبُكُمْ أَيُّهَا"," وَيَطُوفُ عَلَيْهِمْ غِلْمَانٌ"," وَكَم مِّن مَّلَكٍ فِي السَّمَاوَاتِ"," كَذَّبَتْ قَبْلَهُمْ قَوْمُ نُوحٍ","  الرَّحْمَٰنُ","  إِذَا وَقَعَتِ الْوَاقِعَةُ"," فَلَا أُقْسِمُ بِمَوَاقِعِ النُّجُومِ"," أَلَمْ يَأْنِ لِلَّذِينَ آمَنُوا أَن",},
            {"  قَدْ سَمِعَ اللَّهُ قَوْلَ الَّتِي"," أَلَمْ تَرَ إِلَى الَّذِينَ تَوَلَّوْا"," أَلَمْ تَرَ إِلَى الَّذِينَ نَافَقُوا"," عَسَى اللَّهُ أَن يَجْعَلَ بَيْنَكُمْ","  يُسَبِّحُ لِلَّهِ مَا فِي"," وَإِذَا رَأَيْتَهُمْ تُعْجِبُكَ","  يَا أَيُّهَا النَّبِيُّ إِذَا","  يَا أَيُّهَا النَّبِيُّ لِمَ",},
            {"  تَبَارَكَ الَّذِي بِيَدِهِ الْمُلْكُ","  ن ۚ وَالْقَلَمِ وَمَا يَسْطُرُونَ","  الْحَاقَّةُ"," إِنَّ الْإِنسَانَ خُلِقَ هَلُوعًا","  قُلْ أُوحِيَ إِلَيَّ أَنَّهُ"," إِنَّ رَبَّكَ يَعْلَمُ أَنَّكَ تَقُومُ","  لَا أُقْسِمُ بِيَوْمِ الْقِيَامَةِ"," وَيَطُوفُ عَلَيْهِمْ وِلْدَانٌ",},
            {"  عَمَّ يَتَسَاءَلُونَ","  عَبَسَ وَتَوَلَّىٰ","  إِذَا السَّمَاءُ انفَطَرَتْ","  إِذَا السَّمَاءُ انشَقَّتْ","  سَبِّحِ اسْمَ رَبِّكَ الْأَعْلَى","  لَا أُقْسِمُ بِهَٰذَا الْبَلَدِ","  أَلَمْ نَشْرَحْ لَكَ صَدْرَكَ"," أَفَلَا يَعْلَمُ إِذَا بُعْثِرَ مَا",},

    };

    public static String[][][] juzQuarterPrefixLocations = {
            {{"1","1",}, {"2","26",}, {"2","44",}, {"2","60",}, {"2","75",}, {"2","92",}, {"2","106",}, {"2","124",}, },
            {{"2","142",}, {"2","158",}, {"2","177",}, {"2","189",}, {"2","203",}, {"2","219",}, {"2","233",}, {"2","243",}, },
            {{"2","253",}, {"2","263",}, {"2","272",}, {"2","283",}, {"3","15",}, {"3","33",}, {"3","52",}, {"3","75",}, },
            {{"3","93",}, {"3","113",}, {"3","133",}, {"3","153",}, {"3","171",}, {"3","186",}, {"4","1",}, {"4","12",}, },
            {{"4","24",}, {"4","36",}, {"4","58",}, {"4","74",}, {"4","88",}, {"4","100",}, {"4","114",}, {"4","135",}, },
            {{"4","148",}, {"4","163",}, {"5","1",}, {"5","12",}, {"5","27",}, {"5","41",}, {"5","51",}, {"5","67",}, },
            {{"5","82",}, {"5","97",}, {"5","109",}, {"6","13",}, {"6","36",}, {"6","59",}, {"6","74",}, {"6","95",}, },
            {{"6","111",}, {"6","127",}, {"6","141",}, {"6","151",}, {"7","1",}, {"7","31",}, {"7","47",}, {"7","65",}, },
            {{"7","88",}, {"7","117",}, {"7","142",}, {"7","156",}, {"7","171",}, {"7","189",}, {"8","1",}, {"8","22",}, },
            {{"8","41",}, {"8","61",}, {"9","1",}, {"9","19",}, {"9","34",}, {"9","46",}, {"9","60",}, {"9","75",}, },
            {{"9","93",}, {"9","111",}, {"9","122",}, {"10","11",}, {"10","26",}, {"10","53",}, {"10","71",}, {"10","90",}, },
            {{"11","6",}, {"11","24",}, {"11","41",}, {"11","61",}, {"11","84",}, {"11","108",}, {"12","7",}, {"12","30",}, },
            {{"12","53",}, {"12","77",}, {"12","101",}, {"13","5",}, {"13","19",}, {"13","35",}, {"14","10",}, {"14","28",}, },
            {{"15","1",}, {"15","49",}, {"16","1",}, {"16","30",}, {"16","51",}, {"16","75",}, {"16","90",}, {"16","111",}, },
            {{"17","1",}, {"17","23",}, {"17","50",}, {"17","70",}, {"17","99",}, {"18","17",}, {"18","32",}, {"18","51",}, },
            {{"18","75",}, {"18","99",}, {"19","22",}, {"19","59",}, {"20","1",}, {"20","55",}, {"20","83",}, {"20","111",}, },
            {{"21","1",}, {"21","29",}, {"21","51",}, {"21","83",}, {"22","1",}, {"22","19",}, {"22","38",}, {"22","60",}, },
            {{"23","1",}, {"23","36",}, {"23","75",}, {"24","1",}, {"24","21",}, {"24","35",}, {"24","53",}, {"25","1",}, },
            {{"25","21",}, {"25","53",}, {"26","1",}, {"26","52",}, {"26","111",}, {"26","181",}, {"27","1",}, {"27","27",}, },
            {{"27","56",}, {"27","82",}, {"28","12",}, {"28","29",}, {"28","51",}, {"28","76",}, {"29","1",}, {"29","26",}, },
            {{"29","46",}, {"30","1",}, {"30","31",}, {"30","54",}, {"31","22",}, {"32","11",}, {"33","1",}, {"33","18",}, },
            {{"33","31",}, {"33","51",}, {"33","60",}, {"34","10",}, {"34","24",}, {"34","46",}, {"35","15",}, {"35","41",}, },
            {{"36","28",}, {"36","60",}, {"37","22",}, {"37","83",}, {"37","145",}, {"38","21",}, {"38","52",}, {"39","8",}, },
            {{"39","32",}, {"39","53",}, {"40","1",}, {"40","21",}, {"40","41",}, {"40","66",}, {"41","9",}, {"41","25",}, },
            {{"41","47",}, {"42","13",}, {"42","27",}, {"42","51",}, {"43","24",}, {"43","57",}, {"44","17",}, {"45","12",}, },
            {{"46","1",}, {"46","21",}, {"47","10",}, {"47","33",}, {"48","18",}, {"49","1",}, {"49","14",}, {"50","27",}, },
            {{"51","31",}, {"52","24",}, {"53","26",}, {"54","9",}, {"55","1",}, {"56","1",}, {"56","75",}, {"57","16",}, },
            {{"58","1",}, {"58","14",}, {"59","11",}, {"60","7",}, {"62","1",}, {"63","4",}, {"65","1",}, {"66","1",}, },
            {{"67","1",}, {"68","1",}, {"69","1",}, {"70","19",}, {"72","1",}, {"73","20",}, {"75","1",}, {"76","19",}, },
            {{"78","1",}, {"80","1",}, {"82","1",}, {"84","1",}, {"87","1",}, {"90","1",}, {"94","1",}, {"100","9",}, },
    };


    public static int[][] dualPageSets = {{1, 2}, {3, 4}, {5, 6}, {7, 8}, {9, 10}, {11, 12}, {13, 14}, {15, 16}, {17, 18}, {19, 20}, {21, 22}, {23, 24}, {25, 26}, {27, 28}, {29, 30}, {31, 32}, {33, 34}, {35, 36}, {37, 38}, {39, 40}, {41, 42}, {43, 44}, {45, 46}, {47, 48}, {49, 50}, {51, 52}, {53, 54}, {55, 56}, {57, 58}, {59, 60}, {61, 62}, {63, 64}, {65, 66}, {67, 68}, {69, 70}, {71, 72}, {73, 74}, {75, 76}, {77, 78}, {79, 80}, {81, 82}, {83, 84}, {85, 86},

                                {87, 88}, {89, 90}, {91, 92}, {93, 94}, {95, 96}, {97, 98}, {99, 100}, {101, 102}, {103, 104}, {105, 106}, {107, 108}, {109, 110}, {111, 112}, {113, 114}, {115, 116}, {117, 118}, {119, 120}, {121, 122}, {123, 124}, {125, 126}, {127, 128}, {129, 130}, {131, 132}, {133, 134}, {135, 136}, {137, 138}, {139, 140}, {141, 142}, {143, 144}, {145, 146}, {147, 148}, {149, 150}, {151, 152}, {153, 154}, {155, 156}, {157, 158}, {159, 160},

                                {161, 162}, {163, 164}, {165, 166}, {167, 168}, {169, 170}, {171, 172}, {173, 174}, {175, 176}, {177, 178}, {179, 180}, {181, 182}, {183, 184}, {185, 186}, {187, 188}, {189, 190}, {191, 192}, {193, 194}, {195, 196}, {197, 198}, {199, 200}, {201, 202}, {203, 204}, {205, 206}, {207, 208}, {209, 210}, {211, 212}, {213, 214}, {215, 216}, {217, 218}, {219, 220}, {221, 222}, {223, 224}, {225, 226}, {227, 228}, {229, 230}, {231, 232},

                                {233, 234}, {235, 236}, {237, 238}, {239, 240}, {241, 242}, {243, 244}, {245, 246}, {247, 248}, {249, 250}, {251, 252}, {253, 254}, {255, 256}, {257, 258}, {259, 260}, {261, 262}, {263, 264}, {265, 266}, {267, 268}, {269, 270}, {271, 272}, {273, 274}, {275, 276}, {277, 278}, {279, 280}, {281, 282}, {283, 284}, {285, 286}, {287, 288}, {289, 290}, {291, 292}, {293, 294}, {295, 296}, {297, 298}, {299, 300}, {301, 302}, {303, 304},

                                {305, 306}, {307, 308}, {309, 310}, {311, 312}, {313, 314}, {315, 316}, {317, 318}, {319, 320}, {321, 322}, {323, 324}, {325, 326}, {327, 328}, {329, 330}, {331, 332}, {333, 334}, {335, 336}, {337, 338}, {339, 340}, {341, 342}, {343, 344}, {345, 346}, {347, 348}, {349, 350}, {351, 352}, {353, 354}, {355, 356}, {357, 358}, {359, 360}, {361, 362}, {363, 364}, {365, 366}, {367, 368}, {369, 370}, {371, 372}, {373, 374}, {375, 376},

                                {377, 378}, {379, 380}, {381, 382}, {383, 384}, {385, 386}, {387, 388}, {389, 390}, {391, 392}, {393, 394}, {395, 396}, {397, 398}, {399, 400}, {401, 402}, {403, 404}, {405, 406}, {407, 408}, {409, 410}, {411, 412}, {413, 414}, {415, 416}, {417, 418}, {419, 420}, {421, 422}, {423, 424}, {425, 426}, {427, 428}, {429, 430}, {431, 432}, {433, 434}, {435, 436}, {437, 438}, {439, 440}, {441, 442}, {443, 444}, {445, 446}, {447, 448},

                                {449, 450}, {451, 452}, {453, 454}, {455, 456}, {457, 458}, {459, 460}, {461, 462}, {463, 464}, {465, 466}, {467, 468}, {469, 470}, {471, 472}, {473, 474}, {475, 476}, {477, 478}, {479, 480}, {481, 482}, {483, 484}, {485, 486}, {487, 488}, {489, 490}, {491, 492}, {493, 494}, {495, 496}, {497, 498}, {499, 500}, {501, 502}, {503, 504}, {505, 506}, {507, 508}, {509, 510}, {511, 512}, {513, 514}, {515, 516}, {517, 518}, {519, 520},

                                {521, 522}, {523, 524}, {525, 526}, {527, 528}, {529, 530}, {531, 532}, {533, 534}, {535, 536}, {537, 538}, {539, 540}, {541, 542}, {543, 544}, {545, 546}, {547, 548}, {549, 550}, {551, 552}, {553, 554}, {555, 556}, {557, 558}, {559, 560}, {561, 562}, {563, 564}, {565, 566}, {567, 568}, {569, 570}, {571, 572}, {573, 574}, {575, 576}, {577, 578}, {579, 580}, {581, 582}, {583, 584}, {585, 586}, {587, 588}, {589, 590}, {591, 592},

                                {593, 594}, {595, 596}, {597, 598}, {599, 600}, {601, 602}, {603, 604}, };

    public static int[] singlePageSets = {1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100,

                                101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155, 156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168, 169, 170, 171, 172, 173, 174, 175, 176, 177, 178, 179, 180, 181, 182, 183, 184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194, 195, 196, 197, 198, 199, 200,

                                201, 202, 203, 204, 205, 206, 207, 208, 209, 210, 211, 212, 213, 214, 215, 216, 217, 218, 219, 220, 221, 222, 223, 224, 225, 226, 227, 228, 229, 230, 231, 232, 233, 234, 235, 236, 237, 238, 239, 240, 241, 242, 243, 244, 245, 246, 247, 248, 249, 250, 251, 252, 253, 254, 255, 256, 257, 258, 259, 260, 261, 262, 263, 264, 265, 266, 267, 268, 269, 270, 271, 272, 273, 274, 275, 276, 277, 278, 279, 280, 281, 282, 283, 284, 285, 286, 287, 288, 289, 290, 291, 292, 293, 294, 295, 296, 297, 298, 299, 300,

                                301, 302, 303, 304, 305, 306, 307, 308, 309, 310, 311, 312, 313, 314, 315, 316, 317, 318, 319, 320, 321, 322, 323, 324, 325, 326, 327, 328, 329, 330, 331, 332, 333, 334, 335, 336, 337, 338, 339, 340, 341, 342, 343, 344, 345, 346, 347, 348, 349, 350, 351, 352, 353, 354, 355, 356, 357, 358, 359, 360, 361, 362, 363, 364, 365, 366, 367, 368, 369, 370, 371, 372, 373, 374, 375, 376, 377, 378, 379, 380, 381, 382, 383, 384, 385, 386, 387, 388, 389, 390, 391, 392, 393, 394, 395, 396, 397, 398, 399, 400,

                                401, 402, 403, 404, 405, 406, 407, 408, 409, 410, 411, 412, 413, 414, 415, 416, 417, 418, 419, 420, 421, 422, 423, 424, 425, 426, 427, 428, 429, 430, 431, 432, 433, 434, 435, 436, 437, 438, 439, 440, 441, 442, 443, 444, 445, 446, 447, 448, 449, 450, 451, 452, 453, 454, 455, 456, 457, 458, 459, 460, 461, 462, 463, 464, 465, 466, 467, 468, 469, 470, 471, 472, 473, 474, 475, 476, 477, 478, 479, 480, 481, 482, 483, 484, 485, 486, 487, 488, 489, 490, 491, 492, 493, 494, 495, 496, 497, 498, 499, 500,

                                501, 502, 503, 504, 505, 506, 507, 508, 509, 510, 511, 512, 513, 514, 515, 516, 517, 518, 519, 520, 521, 522, 523, 524, 525, 526, 527, 528, 529, 530, 531, 532, 533, 534, 535, 536, 537, 538, 539, 540, 541, 542, 543, 544, 545, 546, 547, 548, 549, 550, 551, 552, 553, 554, 555, 556, 557, 558, 559, 560, 561, 562, 563, 564, 565, 566, 567, 568, 569, 570, 571, 572, 573, 574, 575, 576, 577, 578, 579, 580, 581, 582, 583, 584, 585, 586, 587, 588, 589, 590, 591, 592, 593, 594, 595, 596, 597, 598, 599, 600,

                                601, 602, 603, 604,};



    public static String[][] surahInfo = {
            {"الفاتحة",        "1" , "٠٠١",  "مكي"},
            {"البقرة",         "2" , "٠٠٢",  "مدني"},
            {"آلعمران",        "50" , "٠٠٣",  "مدني"},
            {"النساء",         "77" , "٠٠٤",  "مدني"},
            {"المائدة",        "106" , "٠٠٥",  "مدني"},
            {"الأنعام",        "128" , "٠٠٦",  "مكي"},
            {"الأعراف",        "151" , "٠٠٧",  "مكي"},
            {"الأنفال",        "177" , "٠٠٨",  "مدني"},
            {"التوبة",         "187" , "٠٠٩",  "مدني"},
            {"يونس",           "208" , "٠١٠", "مكي"},
            {"هود",            "221" , "٠١١", "مكي"},
            {"يوسف",           "235" , "٠١٢", "مكي"},
            {"الرعد",          "249" , "٠١٣", "مدني"},
            {"ابراهيم",        "255" , "٠١٤", "مكي"},
            {"الحجر",          "262" , "٠١٥", "مكي"},
            {"النحل",          "267" , "٠١٦", "مكي"},
            {"الإسرى",         "282" , "٠١٧", "مكي"},
            {"الكهف",          "293" , "٠١٨", "مكي"},
            {"مريم",           "305" , "٠١٩", "مكي"},
            {"طه",             "312" , "٠٢٠", "مكي"},
            {"الأنبياء",       "322" , "٠٢١", "مكي"},
            {"الحج",           "332" , "٠٢٢", "مدني"},
            {"المؤمِون",       "342" , "٠٢٣", "مكي"},
            {"النور",          "350" , "٠٢٤", "مدني"},
            {"الفرقان",        "359" , "٠٢٥", "مكي"},
            {"الشعراء",        "367" , "٠٢٦", "مكي"},
            {"النمل",          "377" , "٠٢٧", "مكي"},
            {"القصص",          "385" , "٠٢٨", "مكي"},
            {"العنكبوت",       "396" , "٠٢٩", "مكي"},
            {"الروم",          "404" , "٠٣٠", "مكي"},
            {"لقمن",           "411" , "٠٣١", "مكي"},
            {"السجدة",         "415" , "٠٣٢", "مكي"},
            {"الأحزاب",        "418" , "٠٣٣", "مدني"},
            {"سبا",            "428" , "٠٣٤", "مكي"},
            {"فاطر",           "434" , "٠٣٥", "مكي"},
            {"يس",             "440" , "٠٣٦", "مكي"},
            {"الصافات",        "446" , "٠٣٧", "مكي"},
            {"ص",              "453" , "٠٣٨", "مكي"},
            {"الزمر",          "458" , "٠٣٩", "مكي"},
            {"غافر",           "467" , "٠٤٠", "مكي"},
            {"فصلت",           "477" , "٠٤١", "مكي"},
            {"الشورى",         "483" , "٠٤٢", "مكي"},
            {"الزخوف",         "489" , "٠٤٣", "مكي"},
            {"الدخان",         "496" , "٠٤٤", "مكي"},
            {"الجاثية",        "499" , "٠٤٥", "مكي"},
            {"الأحقاف",        "502" , "٠٤٦", "مكي"},
            {"محمد",           "507" , "٠٤٧", "مدني"},
            {"الفتح",          "511" , "٠٤٨", "مدني"},
            {"الحجرات",        "515" , "٠٤٩", "مدني"},
            {"ق",              "518" , "٠٥٠", "مكي"},
            {"الذاريات",       "520" , "٠٥١", "مكي"},
            {"الطور",          "523" , "٠٥٢", "مكي"},
            {"النجم",          "526" , "٠٥٣", "مكي"},
            {"القمر",          "528" , "٠٥٤", "مكي"},
            {"الرحمن",         "531" , "٠٥٥", "مدني"},
            {"الواقعة",        "534" , "٠٥٦", "مكي"},
            {"الحديد",         "537" , "٠٥٧", "مدني"},
            {"المجادلة",       "542" , "٠٥٨", "مدني"},
            {"الحشر",          "545" , "٠٥٩", "مدني"},
            {"الممتحنة",       "549" , "٠٦٠", "مدني"},
            {"الصف",           "551" , "٠٦١", "مدني"},
            {"الجمعة",         "553" , "٠٦٢", "مدني"},
            {"المنافقون",      "554" , "٠٦٣", "مدني"},
            {"التغابن",        "556" , "٠٦٤", "مدني"},
            {"الطلاق",         "558" , "٠٦٥", "مدني"},
            {"التحريم",        "560" , "٠٦٦", "مدني"},
            {"الملك",          "562" , "٠٦٧", "مكي"},
            {"القلم",          "564" , "٠٦٨", "مكي"},
            {"الحاقة",         "566" , "٠٦٩", "مكي"},
            {"المعارج",        "568" , "٠٧٠", "مكي"},
            {"نوح",            "570" , "٠٧١", "مكي"},
            {"الجن",           "572" , "٠٧٢", "مكي"},
            {"المزمل",         "574" , "٠٧٣", "مكي"},
            {"المدثر",         "575" , "٠٧٤", "مكي"},
            {"القيامة",        "577" , "٠٧٥", "مكي"},
            {"الإنسان",        "578" , "٠٧٦", "مدني"},
            {"المرسلات",       "580" , "٠٧٧", "مكي"},
            {"النبإ",          "582" , "٠٧٨", "مكي"},
            {"النازعات",       "583" , "٠٧٩", "مكي"},
            {"عبس",            "585" , "٠٨٠", "مكي"},
            {"التكوِير",       "586" , "٠٨١", "مكي"},
            {"الإنفطار",       "587" , "٠٨٢", "مكي"},
            {"المطففين",       "587" , "٠٨٣", "مكي"},
            {"الإنشقاق",       "589" , "٠٨٤", "مكي"},
            {"البروج",         "590" , "٠٨٥", "مكي"},
            {"الطارق",         "591" , "٠٨٦", "مكي"},
            {"الأعلى",         "591" , "٠٨٧", "مكي"},
            {"الغاشية",        "592" , "٠٨٨", "مكي"},
            {"الفجر",          "593" , "٠٨٩", "مكي"},
            {"البلد",          "594" , "٠٩٠", "مكي"},
            {"الشمس",          "595" , "٠٩١", "مكي"},
            {"الليل",          "595" , "٠٩٢", "مكي"},
            {"الضحى",          "596" , "٠٩٣", "مكي"},
            {"الشرح",          "596" , "٠٩٤", "مكي"},
            {"التين",          "597" , "٠٩٥", "مكي"},
            {"العلق",          "597" , "٠٩٦", "مكي"},
            {"القدر",          "598" , "٠٩٧", "مكي"},
            {"البينة",         "598" , "٠٩٨", "مدني"},
            {"الزلزلة",        "599" , "٠٩٩", "مدني"},
            {"العاديات",       "599" , "١٠٠", "مكي"},
            {"القارعة",        "600" , "١٠١", "مكي"},
            {"التكاثر",        "600" , "١٠٢", "مكي"},
            {"العصر",          "601" , "١٠٣", "مكي"},
            {"الهمزاء",        "601" , "١٠٤", "مكي"},
            {"الفيل",          "601" , "١٠٥", "مكي"},
            {"قريش",           "602" , "١٠٦", "مكي"},
            {"الماعون",        "602" , "١٠٧", "مكي"},
            {"الكوثر",         "602" , "١٠٨", "مكي"},
            {"الكافرون",       "603" , "١٠٩", "مكي"},
            {"النصر",          "603" , "١١٠", "مدني"},
            {"المسد",          "603" , "١١١", "مكي"},
            {"الإخلاص",        "604" , "١١٢", "مكي"},
            {"الفلق",          "604" , "١١٣", "مكي"},
            {"الناس",          "604" , "١١٤", "مكي"},
    };


    public static String[][][] surahInJuzInfo = {
            {surahInfo[0], surahInfo[1], },
            {},
            {surahInfo[2], },
            {surahInfo[3], },
            {},
            {surahInfo[4], },
            {surahInfo[5], },
            {surahInfo[6], },
            {surahInfo[7], },
            {surahInfo[8], },
            {surahInfo[9], surahInfo[10], },
            {surahInfo[11], },
            {surahInfo[12], surahInfo[13], },
            {surahInfo[14], surahInfo[15], },
            {surahInfo[16], surahInfo[17], },
            {surahInfo[18], surahInfo[19], },
            {surahInfo[20], surahInfo[21], },
            {surahInfo[22], surahInfo[23], surahInfo[24] },
            {surahInfo[25], surahInfo[26], },
            {surahInfo[27], surahInfo[28], },
            {surahInfo[29], surahInfo[30], surahInfo[31], surahInfo[32], },
            {surahInfo[33], surahInfo[34], surahInfo[35], },
            {surahInfo[36], surahInfo[37], surahInfo[38], },
            {surahInfo[39], surahInfo[40], },
            {surahInfo[41], surahInfo[42], surahInfo[43], surahInfo[44], },
            {surahInfo[45], surahInfo[46], surahInfo[47], surahInfo[48], surahInfo[49], surahInfo[50], },
            {surahInfo[51], surahInfo[52], surahInfo[53], surahInfo[54], surahInfo[55], surahInfo[56], },
            {surahInfo[57], surahInfo[58], surahInfo[59], surahInfo[60], surahInfo[61], surahInfo[62], surahInfo[63], surahInfo[64], surahInfo[65], },
            {surahInfo[66], surahInfo[67], surahInfo[68], surahInfo[69], surahInfo[70], surahInfo[71], surahInfo[72], surahInfo[73], surahInfo[74], surahInfo[75], surahInfo[76], },
            {surahInfo[77], surahInfo[78], surahInfo[79], surahInfo[80], surahInfo[81], surahInfo[82], surahInfo[83], surahInfo[84], surahInfo[85], surahInfo[86], surahInfo[87], surahInfo[88], surahInfo[89], surahInfo[90], surahInfo[91], surahInfo[92], surahInfo[93], surahInfo[94], surahInfo[95], surahInfo[96], surahInfo[97], surahInfo[98], surahInfo[99], surahInfo[100], surahInfo[101], surahInfo[102], surahInfo[103], surahInfo[104], surahInfo[105], surahInfo[106], surahInfo[107], surahInfo[108], surahInfo[109], surahInfo[110], surahInfo[111], surahInfo[112], surahInfo[113], },
    };

    public static MadaniFifteenLinePageData getInstance() {
        return ourInstance;
    }

    private MadaniFifteenLinePageData() {

    }
}


